{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented ecommerce and branding features with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, content files, and styling configuration.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark palettes and global styles.",
  "frontend/index.html": "HTML entry point including SEO metadata, Open Graph tags, and React root mount point.",
  "frontend/src/App.tsx": "Main React app assembling navigation, hero, categories, products, cart, and contact sections with cart state.",
  "frontend/src/components/Hero.tsx": "Full-screen hero with brand name, tagline, background image, CTA, and scroll indicator.",
  "frontend/src/components/Layout.tsx": "Minimal layout wrapper providing a main content container.",
  "frontend/src/components/scrollToSection.ts": "Utility for smooth scrolling to sections with header offset.",
  "frontend/src/components/sections/AboutSection.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/sections/CartSection.tsx": "Renders the shopping cart UI, showing items, quantities, subtotal, and controls for updating or removing items.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact information including email, phone, location, and a button to send an email.",
  "frontend/src/components/sections/FeaturedCategoriesSection.tsx": "Shows a grid of featured product categories with images and descriptions.",
  "frontend/src/components/sections/ProductsSection.tsx": "Renders a product grid with images, details, and an Add to Cart button for each item.",
  "frontend/src/components/sections/SamplesSection.tsx": "Empty placeholder file for a future Samples section.",
  "frontend/src/components/sections/ServicesSection.tsx": "Empty placeholder file for a future Services section.",
  "frontend/src/components/TopNav.tsx": "Sticky navigation bar with branding, section links, cart badge, and responsive mobile menu.",
  "frontend/src/content/portfolioContent.ts": "Empty placeholder for portfolio content definitions.",
  "frontend/src/content/storefrontData.ts": "Defines product and category interfaces and provides static sample data for storefront items and categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Implements client‑side cart state with add, remove, quantity update, subtotal, and item count helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, stored identity handling, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future React Query hooks; currently empty.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom OKLCH color variables for light/dark themes, global fonts, and utility classes for scrolling and typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, then renders the App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors driven by CSS variables, extended fonts, animations, plugins, and container settings.",
  "project_state.json": "Stores project metadata, required images, architectural notes, known issues, and feature definitions for the South Essentials ecommerce site."
}